{
    "url": "https://www.goodreads.com/book/show/44767458-dune",
    "title": "Dune",
    "author": "Frank Herbert",
    "rating": 4.28,
    "review_count": 77326,
    "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for... When House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream.",
    "genres": [
        "Science Fiction",
        "Fiction",
        "Fantasy",
        "Audiobook",
        "Science Fiction Fantasy",
        "Classics",
        "Novels"
    ],
    "reviews": [
        {
            "reviewer_name": "Rajat Ubhaykar",
            "review_text": "In my head, the purpose of this review is very clear. It is to convince YOU to read this book. Yes, you! Waste time no more. Go grab a copy. Machiavellian intrigue, mythology, religion, politics, imperialism, environmentalism, the nature of power. All this set in a mind-boggling, frighteningly original world which Herbert ominously terms as an \"effort at prediction\". Dune had me hooked! First impression The very first stirring I felt upon opening the yellowed pages of Dune was that of stumbling upon an English translation of an ancient Arabic manuscript of undeniable power and potence which had an epic story to narrate. The tone was umistakably sombre and I realized Herbert was not here to merely entertain me, he was here to make me part of the legend of Muad'Dib . It was intriguing and challenging and heck, since I live for challenges I decided to take this one up too, gladly. The challenge was the complexity and depth of the plot, which left me perplexed, in the beginning. I knew there were dialogues which meant much more than their superficial meaning and was unable to grasp at it. I felt a yawning chasm between Herbert's vision and my limited understanding of it. However, of course, I plodded on and could feel the gap closing in with every page much to my joy and relief. The Foreword \"To the people whose labours go beyond ideas into the realm of 'real materials'- to the dry-land ecologists, wherever they may be, in whatever time they work, this effort at prediction is dedicated in humility and admiration.\" The foreword makes it pretty clear that Frank Herbert isn't kidding around. This is a serious effort at predicting how our world is going to look two thousand years from now and by God, it's a bloody good and detailed prediction. However, the real merit in this effort lies in the commentary on our lives in the present. Why Frank Herbert is a genius The setting of the book is arid futuristic. the plot is driven by political mind games reminiscent of The Game of Thrones. The issues he tackles are as modern as the colour television. Herbert's genius manifests itself in his ability to combine the past, the present and the future in one sweeping elegant move called Dune. Plot and Setting Dune is set in a futuristic technologically advanced world which after the Butlerian Jihad (the bloody war between Man and Machines) has eliminated all computers and passed a decree declaring \"Thou shalt not make a machine in the likeness of a man's mind\" . Since there are no computers, the essential working of the galaxy is still medieval and feudal with heavy reliance on men and their dallying around. Lots of thriller potential right there. Men with superhuman analytical abilities called Mentats have taken the place of Computers. On the other hand, we have the Bene Gesserit , an ancient school of mental and physical training for female students (it gives them superhuman intuitive powers) who follow a selective breeding program which makes them feared and mistrusted through the Imperium. Their desired end product of this breeding program is the Kwisatz Haderach , a superman who’ll be able to glimpse into the future. How he’ll be able to do this is rooted in Herbert’s idea of determinism: given that one can observe everything and analyze everything, one can effectively glimpse the future in probabilistic terms. Quantum physics anyone? The Kwisatz Haderach is the proposed solution to the male-female dichotomy, between the analytical and intuitive. The plot of Dune is almost wholly set on the desert planet of Arrakis (also referred to as Dune), an arid wasteland where water is so scarce that men have to wear stillsuits which recycle human moisture for further consumption. The source of the galaxy’s interest in the planet is Melange , a spice which bestows upon one longevity and prescient powers. Everything on the planet is permeated with the spice, the air, the sand, the food. Everybody on the planet is hopelessly addicted to the spice, their only hope for survival being their continued intake of the spice. The Spacing Guild , the economic and trading monopolistic arm of the Galaxy badly needs the spice for interstellar transport. This is because their frigates travel faster than the speed of light and hence travel backward in time. The spice is the only way they can look into the future and see their way ahead. How cool is that! All the powers on the Galaxy are out to mine the spice, braving the sandworms, their name merely an euphemism, for they are gigantic 200 metre long creatures which always come digging through the sand whenever spice mining is undertook. Always . There’s also another little glitch. There exist on the planet, the kickass native desert tribal Fremen , whom the foreign powers look down with suspicion and disdain. The Fremen ethos is one of survival and scarcity, driven by tribalism and egalitarianism. Okay, I’ll stop right there. No more spoilers about this. Except that they value water to the extent that spitting on a person is the highest honour they can bestow upon him. Our protagonists are the Atreides family, consisting of the Duke, his Bene Gesserit concubine Jessica and their son Paul, who have been entrusted the stewardship of Arrakis. We discover the alien planet of Arrakis along with them, firstly with fear, suspicion and wonder and ultimately, love and respect. Paul Muad’Dib , however is no ordinary prince. There’s a teeny weeny chance he might be the Kwisatz Haderach , something which troubles him constantly and gives us our conflicted hero. The poor chap trips balls over the spice and has visions of black hordes pillaging and murdering around town bearing his flag and sees his dead body multiple times. My favourite character, however has to be the Baron Vladmir Harkonnen , the most evil character I’ve ever come across in my literary excursions. He is ruddy ruthlessness, he is virile villainy, he is truculent treachery. He executes the inept chess players in his employ which says oodles about his badassery and his fondness for cold-blooded logic. He sees everything in simplistic chess terms. What is my best move? What is my opponent’s best move? Is there anything I can do to completely squash his move? Is there a tactic which leads to mate in three? Themes In this setting, Herbert does so much, it’s unbelievable. Religion, politics, the dynamic nature of power, the effects of colonialism, our blatant destruction of our environment are themes which run parallel to the intensely exciting and labyrinthine plot. He shows the paramount importance of myth making and religion for power to sustain over long periods of time. Man, as a political animal is laid completely bare. Real life Now these are my thoughts about what Herbert could have meant to be Arrakis-  It makes perfect sense. Herbert draws heavy inspiration for the religious ideology of Muad’Dib from Islam. He says “When religion and politics ride in the same cart and that cart is driven by a living Holy man, nothing can stand in the path of such a people.” which is the philosphy of the politics of Islam. Islamism in a nutshell. The spice, much desired by everyone, is the oil. Baron Vladmir Harkonnen is symblomatic of the wily Russians. The Desert foxes Fremen are representative of the native Saudi desert-dwelling Bedouin tribe who have a strongly tribe-oriented culture and undoubtedly value water in equal measure. And the ultimate loser is the environment. Why do good books get over? I almost forget this is a science fiction novel, it’s that real. It is also scary and prophetic. It is a reading experience that will leave you dreaming of the grave emptiness of Arrakis and make you wish you were there to brave it all in the privileged company of the noble Fremen. Frank Herbert achieves the pinnacle of what a sci-fi author aspires to rise to; authentic world building."
        },
        {
            "reviewer_name": "Melissa ♥ Dog/Wolf Lover ♥ Martin",
            "review_text": "Omg! I found a Folio Society Edition a bit cheaper and brand new! You can see all of the art online but look at this cover! Now I have this and Little Women I actually got from their site. I need to get more as I can 😬 ✅Reread 2022 to try to complete series! (I need to get the awesome audio too) 4.5 Stars LOOK DAMN IT! OMG! Mel 🖤🐶🐺🐾 •••••••••••••••• I was so worried that I wouldn't understand a thing in this book. I will admit there are some things that went over my head but for the most part I figured it out. I remember a billion and 65 years ago I watched the movie and was like what the? Basically all I remember is Sting and sandworms. I would love to watch it again and see if I understand it more after reading the book. I'm still not sure what all the spices were about on Arrakis. I keep thinking it's like their farming like we would farm corn or tobacco, etc. I could be wrong and I didn't get the connection between the spice and the sandworms. Is it like a drug to them? I did read in the back of the book that is was like a drug when taken in small quantities and really addictive when taken in large quantities and that Muad'Did felt his prophesies were because of the spice. I liked Duke Leto and I hated that he was betrayed not long after they got to Arrakis. There is always some twat out there causing trouble. I really enjoyed Paul's character and his mother Jessica. They seemed like really strong people and adapted very well in everything they were put through. I didn't really pay too much attention to the other characters or I guess I should say I didn't have many thoughts about them. With the exception of the ones that betrayed them. I really enjoyed when Paul and Jessica had to travel to get away from the evil Baron Harkonnen before they were killed too. I don't know why, but I enjoyed their little journey. I think they were both great in their roles when they were found by the Freman and showed they were a force to be reckoned with. Now maybe I'm getting this all wrong but I'm trying to tell it through the way I saw it in my mind. I don't understand how Paul's sister, Alia, was an abomination. That one must have went over my head too. It might have had something to do with the poison Jessica took to become the Reverend Mother. I'm not sure but I know some of my goodreads friends that read this will get me sorted out =) Other than the sandworms and traitorous people on Arrakis, I was most freaked out by the thought of the water issue! I would NOT was to live somewhere there was a water shortage. And the part where they were talking about selling foot water, I can't even. Which basically means your stinky foot sweat! Anyhoo, I really loved the book! Mel 🖤🐶🐺🐾 ✅Thank you for the answers in my comments! 😊 MY BLOG: Melissa Martin's Reading List"
        },
        {
            "reviewer_name": "Yun",
            "review_text": "Let me start by first apologizing to everyone who loves this classic. I don't doubt Dune was something special when it first came out in the 1960s. But reading it for the first time today, it feels horribly outdated to me and at times almost incomprehensible. I was warned going into this story that the beginning is extremely hard to understand, but that is an understatement. I could barely follow its scene after scene of dialogue referencing people and places and events, all with no explanation or context. It literally feels like I was just dropped into the middle of a book, and everything had already been explained elsewhere. But it gets better, right? Well, only somewhat. A narrative does take shape, but the writing style remains confusing and obscure. It manages to be both long-winded and not clear enough, if you can believe that. Certain obvious points are harped on again and again, but other crucial ones are merely glossed over. Then, when you inevitably miss those important points, they create this cascading effect that keeps you mired in confusion. The writing is also pretentious, with regular or nonsensical things consistently being presented in a profound way. There are plenty of extraneous paragraphs that sound good until you try to discern their meaning, at which point you'd be stumped. This sort of writing really confused me because I couldn't figure out which paragraphs mattered and needed to be dissected carefully to suss out their hidden meaning, and which ones are just adornment. As for the story itself, it was a complete mismatch with my interests. I like science fiction with lots of real science. Instead, this is a space opera (a.k.a. a soap opera that takes place in space) with no actual science. It's all political intrigue, melodrama, doublespeak, and who has power over who, which I have zero interest in. I also couldn't care less about how fawningly amazing Paul is and how he is destined to be the chosen one. This was such a frustrating reading experience because it could've been an amazing story. And there were moments in the beginning when I thought it was going in those creative directions. I was riveted during that infamous test in the first scene, only to realize that it was completely irrelevant to the rest of the story. Or to see where the book could take the scientific aspects of a desert planet and a population with so little water, which it didn't other than a bit of lip service. But the book stubbornly chose to disregard these more interesting avenues, and instead took the most straightforward, boring route of making this into a story about power struggle. Well, we could've saved ourselves the bother and just stayed on Earth for that. ~~~~~~~~~~~~ ✧ Connect with me ✧ Instagram  ✧"
        }
    ]
}