{
    "url": "https://www.goodreads.com/book/show/54493401-project-hail-mary",
    "title": "Project Hail Mary",
    "author": "Andy Weir",
    "rating": 4.5,
    "review_count": 97726,
    "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company. His crewmates dead, his memories fuzzily returning, Ryland realizes that an impossible task now confronts him. Hurtling through space on this tiny ship, it’s up to him to puzzle out an impossible scientific mystery—and conquer an extinction-level threat to our species. And with the clock ticking down and the nearest human being light-years away, he’s got to do it all alone. Or does he?",
    "genres": [
        "Science Fiction",
        "Fiction",
        "Audiobook",
        "Book Club",
        "Fantasy",
        "Space",
        "Thriller"
    ],
    "reviews": [
        {
            "reviewer_name": "Nataliya",
            "review_text": "2025: Four years later this book is just as good and just as much fun. Any book that still, despite knowing the plot, makes me smile on each page deserves to be among the absolute favorites. ———— ———— \n “I’d have to do the math to know for sure but — I can’t help it, I want to do the math right now.” \n This book is half science experiments, half wacky buddy comedy — and it just works so so so well! That nerdy glee I felt on every page of The Martian is back full force. By golly*, I am so gosh-darn* happy right now. Geez and fudge and Holy Moly!*. (Yeah, this book’s protagonist tends to sound like he’s 85 — he’s just not a foul-mouthed sort of a scientist): * \n \n “The whole world put you in charge of solving this problem, and you came directly to a junior high school science teacher?” “Yes.” \n In The Martian , Mark Watney woke up with an antenna sticking out of his chest and realized he had to science the shit out of it if he wanted to survive on Mars. In Project Hail Mary , Ryland Grace wakes up from a coma with a bunch of tubes sticking out of him (including that spot where the sun don’t shine) and realizes that he has no memory of what happened — and eventually, through a bit of complicated science, realizes and remembers that he’s the sole survivor of a mission that’s the last ditch chance to save Earth from a star-eating microbe ( “Evolution can be insanely effective when you leave it alone for a few billion years.”) . For life that needs the output of the Sun it’s not good news. And yes, he also will need to science the shit out of it. \n “How did you do it? What killed it?” “I penetrated the outer cell membrane with a nanosyringe.” “You poked it with a stick?” “No!” I said. “Well. Yes. But it was a scientific poke with a very scientific stick.” \n It’s obvious how wonderfully nerdy Andy Weir is. It’s obvious how happy random science stuff makes him — and that enthusiasm is infectious (not Astrophage-infectious but pretty darn close). As he says in this interview, “My favorite part of writing is the research, and the math, and the figuring all that stuff out.” \n “The largest nuclear reactor on Earth makes about eight gigawatts. It would take that reactor two million years to create that much energy.”   How can you not love a book that shows such resourcefulness and competence in the face of seemingly insurmountable odds? Done with overexcited enthusiasm in the most endearing way, full of sarcastic self-deprecation and humor as coping mechanism , and teaching us science the same way as a very good junior high science teacher may explain concepts to a group of overexcitable preteens. And you betcha that Weir shows his work, and even those not well-versed in science should be able to get it as he really makes it very accessible and non-daunting. \n “No, that’s not creepy at all. Being in a spaceship twelve light-years from home and having someone knock on the door is totally normal.” \n Luckily, unlike Mark Watney, Ryland Grace is not quite alone. Yes, discovering the desiccated bodies of his crewmates makes him think that “I’m going to die out here. And I’m going to die alone” — but this is also a first contact story . ( “I’ve gone from “sole-surviving space explorer” to “guy with wacky new roommate.” It’ll be interesting to see how this plays out.” ) And it plays out in the best possible way, because our alien engineer Rocky is by far one of the best SF characters ever. I mean it. Ever. \n “I don’t want to look dumb in front of the aliens . Because they’re surely watching me right now. Probably counting my limbs, noting my size, figuring out what part they should eat first, whatever.” ———— “Humanity’s first miscommunication with an intelligent alien race . Glad I could be a part of it.” \n  \n \n There are no space battles or invasions or bad guys (well, minus the star-eating microbe that’s doing its star-eating microbe thing while threatening the existence of at least two sentient species in the universe) — nothing that would be typical for the genre. Instead we have smart science and solid reasoning and friendly collaboration that are at the forefront and serve to even out the seemingly insurmountable odds. There is a problem that needs to be solved — and so we are going to solve it, and it’s so much fun . Andy Weir is back in full force, and I’m ridiculously happy about that. \n “What I’m really looking for is something like “Information” or “Here to save humanity? Press this button to learn more!” ———— “I decide on a more tactile approach: I’m gonna start pushing buttons! Hopefully there’s no “Blow Up the Ship” button.” \n Just like The Martian , it’s one of those books that restore the faith in humanity even for the most jaded of us. Because when we put our minds to it we can cooperate and collaborate and do wonderful things. \n “But there’s no reason aliens would follow the righty-tighty-lefty-loosey rule, is there?” \n Oh, and I think I highlighted about half of this book, and I’m running out of the ways to include quotes in my review, so yeah. I love it. \n “Oh thank God. I can’t imagine explaining “sleep” to someone who had never heard of it. Hey, I’m going to fall unconscious and hallucinate for a while. By the way, I spend a third of my time doing this. And if I can’t do it for a while, I go insane and eventually die. No need for concern.” \n 5 stars, safely Astrophage-free. —————— Also posted on my blog . —————— My Hugo and Nebula Awards Reading Project 2022 "
        },
        {
            "reviewer_name": "Julie In Wonderland",
            "review_text": "Andy Weir cannot write and I'm tired of people pretending he can. First, let's talk about characters- well, there is no character here. I only see a vague man-shaped science textbook in an astronaut suit. Wait, let me put my glasses on. OH, I know him. Quirky, wisecracking, nerd who likes space.. It's Mark Watney. Mark Watney's alone in the space, again. Oh. Can you believe his luck? Anyway, he's alone and he's quirky and nerdy and that's all very nicely boring but hold on.. there are flashback scenes. We get to meet other people. A diverse group of scientists from many countries to save the world. YAY. No, I take that back. No YAY. This is no diverse group of scientists. This is a collection of bad, outdated racial and character stereotypes stolen from bad Hollywood movies from white directors. Sure, the Russian drinks vodka. Asians speak with horrible accents. (I was ready to punch the narrator at that point.) Kids are all polite and interested in lessons and all laugh at the teacher's jokes. (This Mark Watney Pro Max is a schoolteacher and Andy Weir's never been in a classroom) The bossy female boss is bossy. Scientists make sex jokes that are not funny if you're not a 14 year old virgin. (Remember that famous The Martian boobs emoticon? I just love Andy Weir's characters.) And of course, every one lovessss our hero. There's even a line in the book along the lines of  'everyone likes you better'  . Yes, really. It just grates on my nerves. It's obvious the author does not have much experiences with human relationships but instead of using that and giving his characters more life and making them awkward and human, he has to have them become HEROes: perfect little Gary Stus who are smart and nerdy social butterflies, and most popular guys in the multiverse. Wait, there's an alien. Oh my god, finally something interesting.......annd it's not. Rocky, the alien's character, had to be offensive to aliens if aliens read badly-written sci-fi books. He waves and thumbs up and mimics our hero because 1, that's logical we all mimic when we see another species make weird signs with their appendages and 2,because the alien has no culture of his own apart from what a 12 year old kid thinks how aliens eat, sleep and shit. Once they got talking, (yes they talked. I'll get to that later.), we finally learn Rocky's personality. It must be quite different from humans, coming from a different universe and all but wait a minute. He's nerdy and quirky and is talking like a certain human we know. *Gasps He's Mark Watney with eight legs. By now, we've already got a Mark Watney in the spacecraft Hail Mary. There is a Russian Mark Watney on Earth with vodka. Another Mark Watney with boobs. An Asian Mark Watney. Now there's an alien Mark Watney. It's an abundance of Mark Watneys. Who said this is not sci-fi horror? Mom, pick me up. I'm scared. So let's take a look at the plot maybe that's where the five star reviews get their stars from. But... but....there is no plot. I actually liked the idea of an apocalypse causing aliens being single celled bacterium kind of organisms but that's it. Apart from this, the rest of the whole plot is a childish daydream that could be concocted by any middle grade school children who have watched star trek once. It is juvenile to the point of embarrassing. A junior school-teacher is the hero Earth sent for the first ever interstellar mission? Okay. Sounds unrealistic but okay. Then he's the first person to be allowed to experiment on the astrophage (the alien space invaders). That's it. Just him in a laboratory. For a world-ending scientific discovery. One person is coordinating the entire multinational mission. And she's exempted from any legal repercussions. She's absurd to the point of not resembling a human female. Andy Weir would have us think she's a real human woman but I bet she's a robot and Andy Weir doesn't even know it. Two of the entire 3 person-crew died leaving only our hero. (Not a spoiler. Happens at the very beginning.) That's probably because Andy Weir knows he can't handle more than the astounding number of one character. So, he killed them off. Nice. He met an alien and everything goes smoothly because Our HERO figures out the alien language in record time. Of course. And not just general phrases but really long, completed sentences. Combine that with their shared personality or lack there of, makes their conversations sound like a kid playing astronauts and aliens by himself. And this all happens in the first chapters. The rest is just massive info dumps from our hero (I'll just keep saying our hero because that's what the MC and Andy Weir wants us to think. H.E.R.O.) because he's so smart and awesome and convenient problems arising only to be solved by, you guess it, our hero because he's so good at science stuff and, you know, so smart and awesome. This whole plot is a slap to the face but the ending? It's a kick to the groin. It's like Andy Weir thinks 'Well, you've endured this whole fairy tale, might as well get this cheesy and extremely implausible ending shoved down your throat. Goodbye.' This is not a book but a wish fulfilment of a childish sci-fi fantasy Andy Weir must have thought up during one boring physics class back in middle school and it's utterly embarrassing. If I had written it, I would not have showed it to my cat, let alone a publisher. At the end, Andy Weir did not make me care about Mark Watney Pro Max nor about Earth and apocalypse or Rocky even. Everything's just over the top and ridiculous. It's like a parody. Not a real novel. I saw that it's already been bought to be made into a movie. The Martian movie was 100000 times better and if this is turned into a movie, who knows? I might enjoy it. Maybe Andy Weir is better suited at drafting movie ideas than actually writing these not-books. Because honestly, this is the second time I've tried his writing and both times, I felt like I was trapped in an elevator during blackout with someone I can’t stand."
        },
        {
            "reviewer_name": "Emily May",
            "review_text": "I think my job is to solve the Petrova problem. \t\t\t …in a small lab, wearing a bedsheet toga, with no idea who I am, and no help other than a mindless computer and two mummified roommates. \n Guess I was wrong to resist reading this for months. Thing is, I liked The Martian and really really disliked Artemis . In fact, Weir's second novel bored and annoyed me so much that I was set against ever reading his future books. But after seeing positive review after positive review and having friends tell me to read this, I finally did. And Project Hail Mary was so much fun. And science-y. And a bit sad. But mostly fun. It's a different sort of story, but Project Hail Mary contains a lot of the stuff that made The Martian good. The stakes in the novel feel immense, the chance of coming up with a plan and getting out of the central predicament seems tiny, and all of this science drama is juxtaposed with the narrative voice-- basically, a funny, can't-help-but-love-him nerd who manages to put his brain to work in the direst of circumstances. We begin with Ryland Grace waking up on a spaceship with no idea who he is and how he got there. Exploring his surroundings, he quickly discovers that his crew mates are dead and he is humanity's last hope for survival. I won't reveal his mission because I think learning about it through flashbacks is part of the fun, and the more we learn the more impossible his mission seems. I'll leave it at that. The book alternates between the past in the run up to the mission as we discover the huge problem humanity faces, and the present in which Ryland Grace attempts to save our planet. The world of the novel gets bigger and wilder and I have to say I very much enjoyed the adventure and mystery. It's not five stars for me because I felt it ran on a little long in the middle with the characters having one nerdgasm after another (which seems to be a thing with Weir) and I also saw the \"twist\" coming, if you can call it that the one about what Stratt did . But the later chapters of the novel were really strong and quite... bittersweet, actually."
        }
    ]
}