{
    "url": "https://www.goodreads.com/book/show/68428.Mistborn",
    "title": "Mistborn: The Final Empire",
    "author": "Brandon Sanderson",
    "rating": 4.49,
    "review_count": 68943,
    "description": "What if the whole world were a dead, blasted wasteland? \n Mistborn For a thousand years the ash fell and no flowers bloomed. For a thousand years the Skaa slaved in misery and lived in fear. For a thousand years the Lord Ruler, the \"Sliver of Infinity,\" reigned with absolute power and ultimate terror, divinely invincible. Then, when hope was so long lost that not even its memory remained, a terribly scarred, heart-broken half-Skaa rediscovered it in the depths of the Lord Ruler's most hellish prison. Kelsier \"snapped\" and found in himself the powers of a Mistborn. A brilliant thief and natural leader, he turned his talents to the ultimate caper, with the Lord Ruler himself as the mark. Kelsier recruited the underworld's elite, the smartest and most trustworthy allomancers, each of whom shares one of his many powers, and all of whom relish a high-stakes challenge. Then Kelsier reveals his ultimate dream, not just the greatest heist in history, but the downfall of the divine despot. But even with the best criminal crew ever assembled, Kel's plan looks more like the ultimate long shot, until luck brings a ragged girl named Vin into his life. Like him, she's a half-Skaa orphan, but she's lived a much harsher life. Vin has learned to expect betrayal from everyone she meets. She will have to learn trust if Kel is to help her master powers of which she never dreamed. Brandon Sanderson, fantasy's newest master tale-spinner and author of the acclaimed debut Elantris , dares to turn a genre on its head by asking a simple question: What if the prophesied hero failed to defeat the Dark Lord? The answer will be found in the Mistborn Trilogy, a saga of surprises that begins with the book in your hands. Fantasy will never be the same again.",
    "genres": [
        "Fantasy",
        "Fiction",
        "High Fantasy",
        "Audiobook",
        "Epic Fantasy",
        "Magic",
        "Adult"
    ],
    "reviews": [
        {
            "reviewer_name": "Petrik",
            "review_text": "I have a Booktube channel now! Subscribe here: https://www.youtube.com/petrikleo Here it is, the beginning of the trilogy that sparked my love for reading fantasy novels. It’s been exactly one year ten months since I first joined Goodreads or started reading The Final Empire for the first time; it was on September 1st, 2016. There’s no doubt that The Final Empire is an extremely important book for me. It’s not easy for me to elaborate upon this; a cliché such as “I absolutely love this book” is not enough, and the reason behind the significance of this trilogy for me will have to be postponed until I’m done with rereading The Hero of Ages . The impact that this trilogy left on my life is immeasurable, and my life before and after I finished this trilogy for the first time is a different one from each other. I predict this will happen within a week or two from now, but for now, let’s talk about The Final Empire , and why—even upon reread—it’s an absolutely incredible start to a trilogy. Picture: The Final Empire by breath-art The Final Empire is the first book in Brandon Sanderson’s highly acclaimed Mistborn trilogy. For a thousand years, the world has been ruled with an iron fist by the immortal emperor: Lord Ruler. The main plot of the book revolves around a rebellion to overthrow the lord ruler; this rebellion is built around a heist led by Kelsier, his team, and his newly found apprentice—Vin. I immensely enjoyed reading The Final Empire ; the first time I read this novel, I found the plot to be thoroughly engaging, relatable, and at times humorous due to the character’s camaraderie and banter. And I was also completely fascinated by the world-building and magic system that Sanderson has created here. On reread, all of these are still true, but there’s a new additional superb quality: all the foreshadowing and hints are now laid bare for me to see with the gift of hindsight. The Final Empire , on its own, works perfectly as a standalone, but trust me that there’s so much more to the story beyond this book. Everything you read here—even the mini details—played major parts in the upcoming sequels. \n \n \"Plots behind plots, plans behind plans. There was always another secret.” \n \n Picture: Kelsier and Vin by GisAlmeida Where should I even begin with the wonderful characterizations? I guess I’ll start with Vin. I’ve read more than 200 books since the first time I finished reading this trilogy, and Vin—by the end of the trilogy—still stands strong as one of my favorite heroines of all time. This, of course, doesn’t mean that Vin was the only great character from the series; Kelsier, Sazed, Elend, and many other characters were so memorable as well. I can’t mention them all in this review because their greatness hasn’t occurred yet here. Ever since I read this book for the first time, I’ve heard from several readers that they found Vin to be incredibly emo and annoying; I disagree with this. Vin had a rough past. I think Sanderson did a great job in conveying Vin’s insecurity and emotions. Vin’s thoughts felt believable to me, and I found her character’s development to be amazing. She taught me that despite being betrayed and left behind countless times, it’s always okay—and better—to love and trust someone again rather than being alone. And then Kelsier taught me about the meaning of justice and hope; it’s not okay to stand still in the face of tyranny, oppression, and slavery. \n \n “Men rarely see their own actions as unjustified.” \n \n Sazed taught me that differences in faith can still lead to being respectful and kind towards each other’s beliefs. \n \n “Our belief is often strongest when it should be weakest. That is the nature of hope.” \n \n There were plenty of things to learn from the character’s actions in the book. But for now, I want to discuss the next highlight of the novel—and trilogy—itself: the magic system. The Final Empire introduced us to Allomancy and Feruchemy. Honestly speaking, coming from a gaming and manga/anime background, I thought I would never encounter a magic system as good as the one often told in these two mediums within a novel format. However, I was proven wrong. Allomancy is amazing, and it’s still by far my favorite magic system in the entire fantasy genre. Yes, I think it’s even better than the one shown in Sanderson’s magnum opus— The Stormlight Archive —so far. The intricacy of the magic system that Sanderson has crafted in Mistborn Saga never ceased to amaze me, and I’ve yet to encounter a more engaging, complex, and amazingly easy-to-understand magic system in any other fantasy novels. Plus, the actions spawned from the magic system resulted in some incredibly vivid and fast-paced battle sequences. This book was also my first encounter with Sanderson’s spectacular world-building. Accompanied with Sanderson’s accessible, vivid, and immersive prose, the world of Scadrial that’s clouded by ash and surrounded by mist felt extremely atmospheric to read. There was also a lot of well-built mystery and lore within this book; Sanderson used the epigraph at the beginning of each chapter masterfully. I’ve heard a lot of criticisms from several readers that Sanderson’s prose can be a bit too simple to their liking, and I can certainly agree that—not only this book—all of his books contain simplistic prose. However, that’s actually one of the things that I appreciate about his works. His writings never get in the way of the story, and he’s brilliantly capable of telling a story of epic proportion with his accessible writing style. And this doesn’t mean that the narrative is lacking in wisdom or impact. In my opinion, all of Sanderson’s books in the Cosmere universe contained a lot of relatable wisdom easily applicable to our daily life. A few examples: \n \n “The right belief is like a good cloak, I think. If it fits you well, it keeps you warm and safe. The wrong fit however, can suffocate.” \n \n or this \n \n “You should try not to talk so much, friend. You'll sound far less stupid that way” \n \n And with that quote, I realized that it’s time for me to put an end to my review here. It’s safe to say that I still consider The Final Empire as one of my favorite books and one of my favorite starts to a trilogy. My reread experience of this book has been better than I expected, and I can’t wait to see how the rest of the trilogy will hold up for me. Below here—just for fun, cringe, and nostalgia factors—is the first review I’ve ever written. Hopefully, I did a better job this time! :) You can order the book from: Book Depository (Free shipping) You can find this and the rest of my reviews at Novel Notions Special thanks to my Patrons on Patreon for giving me extra support towards my passion for reading and reviewing! My Patrons: Alfred, Alya, Annabeth, Ben, Blaise, Devin, Diana, Dylan, Edward, Ellen, Gary, Hamad, Helen, Jimmy Nutts, Joie, Luis, Lufi, Melinda, Mike, Miracle, Nicholas, Sarah, Seth, Shaad, Summer, Wendy, Zoe. ------------------------ My first review on Goodreads and I'm really happy it's this book that I chose. The book have an amazing world-building, great characters development and most of all, very intricate magic system and actions. This is coming from someone who've seen plenty of magics (not real of course) from 20 years of gaming and watching anime/movie/television series. The amount of details Sanderson put into each words (not to mention it's really simple and easy to understand) is insane. I will definitely read the rest of the trilogy straight after this and more works by him!"
        },
        {
            "reviewer_name": "Benjamin Duffy",
            "review_text": "I can't remember being this violently conflicted about a book in quite some time. There are some areas where it's so incredibly well done, with the author absolutely nailing it, and then others where I found myself grinding my teeth in frustration. I'm going to abandon my usual practice of writing short, pithy reviews and just drunkenly ramble on a few things here. (Still no spoilers, though.) That OK with y'all? Language. About two and a half chapters into this book, I found myself asking, \"Why does this feel like a YA fantasy book?\" It wasn't the subject material or the plot, both of which are much more sophisticated than Harry Potter and his ilk. While I would feel perfectly comfortable having a 12-year-old read this PG13-violent and utterly asexual book, I don't feel as though it's necessarily written for tweens. Finally it occurred to me: it's the language . This book is one of the most simply written books I've ever read, using only the most basic vocabulary. That isn't a bad thing, as I'd rather read something direct and simple than something flowery and overwritten, but Sanderson's language is so simple here that it's almost as if he's drawing with the Crayola 16-set when other authors have the big 64. (One notable exception: having apparently become recently enamored of the word, he uses maladroitly at least three times. Maybe he was jamming some Weezer while he wrote.) I haven't read any of his other works (yet; Mistborn #2 is on deck), but I have to assume this simplicity is by conscious choice, and it's an interesting choice at that. I'm just not sure yet how I feel about it. One language choice that I am sure how I feel about is Sanderson's decision to have his characters speak good old American English. The narration is similarly plainspoken, with a fair amount of American slang thrown in, rather than the twee, faux-Elizabethan style of a lot of fantasy authors. I like the approach. One of the most time-honored fantasy tropes is having all the characters thee and thou each other, with a few ne'er did yon stars of Yomama glimmer so resplendently, my suzerain for good measure. And I can handle that stuff, having been weaned on Tolkien and everything that came after, but I found Sanderson's decision to move away from that convention refreshing. I interpreted it as Sanderson saying, \"The unspoken assumption here is that this book has been translated from whatever languages they speak on this made-up world, so why translate it to anything other than what is most understandable and comfortable for you to read? To couch this story in funky language is to insult your imagination by implying that you need that in order to realize you're reading a fantasy novel.\" Setting and Plot. The setting is a typical high fantasy world - feudal-style nobility and peasantry; shadowy, powerful priesthood; mysterious evil lord, etc. - with some odd, almost steampunk flourishes thrown in. There are wristwatches. Men's formal wear is described as something more like Victorian coat and tails than medieval garb. Magic in this world is fueled by elemental and alloyed metals, which are described rather precisely, using percentages. It's a unique and interesting blend. The basic plot is about as stock as it gets. If you're familiar with the Star Wars films, the Harry Potter or Percy Jackson books, Eragon , the Dragonriders of Pern trilogy, Dune , Ender's Game , or any one of about a million other works, please play Mad Libs with me: Dear [kid with weird name] , I know you are only a [farmer / orphan / urchin / child of a minor noble] , and this will be hard for you to accept, but you [have Great Powers / are the Chosen One / insert name of funky power here] . You are the only one who can [save the world / save the universe / defeat the Empire / restore order to the Force / kill the Big Boss] . Luckily, even though you just learned your destiny fifteen minutes ago, you will make up for lost time by quickly becoming better than anyone in the history of ever at [Quidditch / dragon riding / sandworm riding / Allomancy] . Any questions? Needless to say, the plot could have been a one-way express ticket to Hack City, but it really isn't. Vin's growth and development are handled well. Exposition. This is a fantasy book for the video game generation. By that, I mean that the book follows the general path of a first-person RPG: 1) Introduction to the world and the main characters 2) A few early levels whose only apparent purpose is to teach the player how to use the buttons 3) Quests of increasing difficulty, with progressive reveals of the Big Plot 4) Fight with the Main Boss, including the inevitable twist 5) Denouement and teaser for the next installment. Not that that's a bad thing! But I was really surprised at the way Allomancy (the main \"magic\" in this world) was laid out. In the two towering fantasy/sci-fi works of the 20th century, The Lord of the Rings and Dune , the supernatural elements of the story operated behind a sort of curtain or screen. The One Ring in LotR and the spice Melange in Dune both held great, mysterious powers, but the specific effects and extent of those powers were seen only in fits and flashes, and never understood completely by the characters or the reader. In contrast, fairly early in this book, Kelsier takes Vin on a practice run where he explains how her powers work and what their advantages and limitations are, using plain language and real-world physics, and lets her fly and mess around and just generally exult in her magic. It left me, the reader, as well as Vin the character, feeling that even if we didn't understand this magic perfectly right now, we might at some point in the future, which was a very different feel. OK, after enough rambling about things I feel ambivalently about, let's wrap up with one big win and one big fail: WIN: Brandon Sanderson can write the hell out of an action scene. (And since the final quarter of this book is pretty much all action, playing directly into Sanderson's strengths, it kicks all kinds of ass.) The fights in this book are gut-wrenching without being overly gory, and the chases and sneaks are heart-stopping as well. Perfect combination of pace and detail. Amazing. Possibly the best I've ever read from an author in this genre, and if he's able to do that so effortlessly, so early in his career, it gives me hope that he can fix... FAIL: ...the dialogue. In spite of being favorably disposed due to the use of informal American English, I eventually found the dialogue here really clunky. Everyone is too wordy. Everyone says one sentence too many. Over and over again, I found myself going, \"Real people don't talk like this,\" and especially, \"Real people who are supposed to be close friends don't talk anything like this to each other.\" Seriously, think of how you talk to your best friends in private, then compare it to this book. In addition, there was always that odd feeling of unneeded exposition, as if the characters were talking half to each other and half to the reader. It was unfortunate, especially in contrast to how slick and fast-moving and just plain awesome a lot of the other writing was. All in all, this was a fun, kinetic read...with a few holes in it. It builds, it explodes, and the ending is really good. If half-stars were allowed, this would have been a 3 1/2. Good stuff. Also, here are my (spoiler-free, suitable as previews) reviews of the second and third books in the series, if you enjoyed this one!"
        },
        {
            "reviewer_name": "Val ⚓️ Shameless Handmaiden ⚓️",
            "review_text": "6/21 Re-reading... Thank the Lord Ruler I finally crawled out from whatever rock I was living under and finally decided to read this book. Because. It. Was. So. Fucking. Awesome. I have been telling myself for years that I should try and branch out from just romance, paranormal romance, UF romance, sci-fi alien smut and the occasional murder mystery or biography (not that there is a damn thing wrong with my beloved romance, but just to challenge myself to try something new) and attempt to tackle a straight high fantasy. Well, this book was my first true foray into that genre and all I can say is... * * * LOLZ. Jay kay, peeps, jay kay. Just making sure I live down to your expectations. *wink* In all sincerity though, this book was everything and I truly don't know why I waited so long to tackle this genre. Comic/Sci-Fi/Fantasy movies are my all time FAVORITE movie genres. And this book felt like I was locked in one of them. Like I was in a theater watching an epic fantasy film. Only BETTER. Because we ALL know the book is always better. Brandon Sanderson is now a front runner in the Val's Spirit Animal Games and I just want to sit across from him at a pub table and watch him breathe. His world building is so amazing, I can't even. I was enthralled from page one until page end. This is an older book and and I'm late to the fiesta, so I'll stop there; but long story short, I loved this thing so hard I might sleep with it under my pillow for a while. And the best part? There are now aisles of books at the bookstore that I feel have suddenly been opened to me. AISLES, people. So glad I tried something new. I feel so mature.  Three cheers for Garth."
        }
    ]
}